Repository: 84000/data-translation-memory
Catalog: toh562-v3.tmx
Source language: bo
Languages: en

source: བསམ་པ་རྒྱ་ཆེན་པོ་དང་ལྡན་པས་རྒྱལ་པོ་ཆེན་པོ་བཞིའི་གཟུགས་ལྡོང་རོས་སམ་བཙག་གིས་བྲིས་ལ། སྤོས་ཐམས་ཅད་དང་ལྡན་པའི་དཀྱིལ་འཁོར་གྲུ་བཞི་པ་བྱས་ནས་སངས་རྒྱས་ཀྱི་སྤྱན་སྔར་དུས་གསུམ་དུ་བརྗོད་པར་བྱའོ།
en: They should make a four-cornered maṇḍala that is replete with all incenses and recite the sūtra before the Buddha throughout the three periods of the day.

source: །བསིལ་བའི་ཚལ་གྱི་མདོ་ཆེན་པོ་རྫོགས་སོ།། །།པཎྜི་ཏ་ཤཱི་ལེནྡྲ་བོ་དྷི་དང་།
en: This concludes “The Great Sūtra of Cool Grove.”

source: ཛྙཱ་ན་སིདྡྷི་དང་། ཤཱཀྱ་པྲ་བྷ་དང་། ལོ་ཙཱ་བ་བནྡེ་ཡེ་ཤེས་སྡེས་བསྒྱུར་ཅིང་ཞུས་ཏེ་སྐད་གསར་ཆད་ཀྱིས་ཀྱང་བཅོས་ཏེ་གཏན་ལ་ཕབ་པ།། །།
en: This was translated and edited by the Indian preceptors Śīlendrabodhi, Jñānasiddhi, and Śākyaprabha and the translator-editor Bandé Yeshé Dé.

source: ཕྱིས་འགོས་གཞོན་ནུ་དཔལ་གྱིས་ཆག་ལོ་ཙཱ་བའི་ཕྱག་དཔེ་ལས་ཞུས་སོ།།
en: It was then finalized after revising it based on the new lexicon. Later, Gö Shönu Pal revised it based on a Sanskrit manuscript belonging to Chak Lotsāwa.
